Revit 2023 API
Rebar.GetFreeFormAccessor Method
 Returns an interface providing access to free-form properties and methods for this Rebar element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2018
Syntax
C#
public RebarFreeFormAccessor GetFreeFormAccessor()
Visual Basic
Public Function GetFreeFormAccessor As RebarFreeFormAccessor
Visual C++
public:
RebarFreeFormAccessor^ GetFreeFormAccessor()
Return Value
 The interface providing access to free-form properties and methods for this Rebar element.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Structural.
Autodesk.Revit.Exceptions.InvalidOperationException |  This method applies only to free form rebar.
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace